In [59]:
df = pd.read_sql_query('select * from ineuronstudent',conn)
df

C:\Users\Ranjit Singh\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    stuid             name  roll  age       city
0       1     Ranjit Singh    68   25    Hathras
1       2        sudhanshu   100   45   bangluru
2       3            Usman    58   26   bangluru
3       4          praveen    67   21  prayagraj
4       7            sumit    69   28    chhapra
5       8           shivam    64   22  firojabad
6       9          padmesh    70   26  hyderabad
7      10             aman    19   20   devariya
8      11     ishita gupta    24   20       agra
9      12            Nitin    25   24    aligarh
10     13       Riya dixit    29   21    hathras
11     14      mayur varma    43   21    mathura
12     15  prashant sharma    21   27    aligarh
13     16           pankaj    41   42     mummai
14     17         abhijeet     2   49    kolapur

In [28]:
import mysql.connector as mc
import pandas as pd

In [8]:
conn = mc.connect(user='root',password ='Jigar@975919',host='localhost',port =3306)

In [9]:
conn.is_connected()

True

In [10]:
cur = conn.cursor()

In [11]:
cur.execute('show databases')
for i in cur.fetchall():
    print(i)

('first_schema',)
('ineuron',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('taskdb',)
('world',)

## again established th3 connection with the databases

In [51]:
conn = mc.connect(user='root',password ='Jigar@975919',host='localhost',port =3306,database = 'ineuron')

In [52]:
conn.is_connected()

True

In [53]:
cur = conn.cursor()

In [54]:
cur.execute('show tables')


# singl3 table exist there

In [48]:
cur.fetchone()

('ineuro',)

In [27]:
cur.execute('select * from ineuronstudent')
for i in cur.fetchall():
    print(i)

(1, 'Ranjit Singh', 68, 25, 'Hathras')
(2, 'sudhanshu', 100, 45, 'bangluru')
(3, 'Usman', 58, 26, 'bangluru')
(4, 'praveen', 67, 21, 'prayagraj')
(7, 'sumit', 69, 28, 'chhapra')
(8, 'shivam', 64, 22, 'firojabad')
(9, 'padmesh', 70, 26, 'hyderabad')
(10, 'aman', 19, 20, 'devariya')
(11, 'ishita gupta', 24, 20, 'agra')
(12, 'Nitin', 25, 24, 'aligarh')
(13, 'Riya dixit', 29, 21, 'hathras')
(14, 'mayur varma', 43, 21, 'mathura')
(15, 'prashant sharma', 21, 27, 'aligarh')
(16, 'pankaj', 41, 42, 'mummai')
(17, 'abhijeet', 2, 49, 'kolapur')

## by using pandas

In [29]:
df = pd.read_sql_query('select * from ineuronstudent',conn)
df
# by using this function you can easily import the data from the database

C:\Users\Ranjit Singh\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    stuid             name  roll  age       city
0       1     Ranjit Singh    68   25    Hathras
1       2        sudhanshu   100   45   bangluru
2       3            Usman    58   26   bangluru
3       4          praveen    67   21  prayagraj
4       7            sumit    69   28    chhapra
5       8           shivam    64   22  firojabad
6       9          padmesh    70   26  hyderabad
7      10             aman    19   20   devariya
8      11     ishita gupta    24   20       agra
9      12            Nitin    25   24    aligarh
10     13       Riya dixit    29   21    hathras
11     14      mayur varma    43   21    mathura
12     15  prashant sharma    21   27    aligarh
13     16           pankaj    41   42     mummai
14     17         abhijeet     2   49    kolapur

In [31]:
cur.execute('CREATE table ineuro(stuid INT ,name varchar(30),roll int,age int ,city varchar(30))')

In [49]:
cur.fetchone()

('ineuronstudent',)

In [55]:
cur.fetchone()

('ineuro',)

In [58]:
cur.fetchone()

('ineuronstudent',)